In [2]:
import pandas as pd

In [3]:
a= pd.DataFrame({'a' : [1, 5, 9], 'b' : [2, 6, 8]})
b= pd.DataFrame({'a' : [1, 6, 9], 'b' : [2, 6, 9]})

In [4]:
a

   a  b
0  1  2
1  5  6
2  9  8

In [5]:
b

   a  b
0  1  2
1  6  6
2  9  9

In [47]:
mydict = {'a' : [1,3], 'b': [4,2]}

In [51]:
df = pd.DataFrame.from_dict(mydict)

In [52]:
df

   a  b
0  1  4
1  3  2

In [60]:
df

   a  b
0  1  4
1  3  2

In [61]:
df.loc[len(df)] = [5,5]

In [62]:
df

   a  b
0  1  4
1  3  2
2  5  5

In [53]:
pd.concat([b,df], ignore_index=True, axis=0)

   a  b
0  1  2
1  6  6
2  9  9
3  1  4
4  3  2

In [15]:
a.compare(b)

     a          b
  self other self other
1  5.0   6.0  NaN   NaN
2  NaN   NaN  8.0   9.0

In [16]:
a-b

   a  b
0  0  0
1 -1  0
2  0 -1